***Filtering Dataframe based on conditions***

In [49]:
import pandas as pd

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [4]:
employees = ['John', 'Jane','Jim','Jill','Jack']
department = ['HR', 'IT', 'Finance', 'IT', 'HR']
salary = [50000, 60000, 70000, 65000, 55000]

df = pd.DataFrame({'employees' : employees, 'department' : department, 'salary' : salary} )
df

  employees department  salary
0      John         HR   50000
1      Jane         IT   60000
2       Jim    Finance   70000
3      Jill         IT   65000
4      Jack         HR   55000

In [28]:
df.loc[(df.department == 'IT') & (df.salary > 60000), ('employees')]

3    Jill
Name: employees, dtype: object





***Renaming Columns***

In [54]:
data2 ={
    'product_id' : [101, 102, 103]
, 'product_name' : ['Laptop', 'Phone', 'Tablet']
, 'product_price' : [1000, 800, 600] }

df2 = pd.DataFrame(data2)
df2

   product_id product_name  product_price
0         101       Laptop           1000
1         102        Phone            800
2         103       Tablet            600

In [57]:
df2.rename(columns = {'product_id' : 'ID', 'product_name' : 'Name', 'product_price' : 'Price'}, inplace = True)
# if inplace is set to false (default value), then the original dataset does not change. To modify the original df, use inplace = True)
df2

    ID    Name  Price
0  101  Laptop   1000
1  102   Phone    800
2  103  Tablet    600

***Handling Missing Values***

In [60]:
data3 = {
'product' : ['Laptop', 'Tablet', 'Phone', 'Monitor', 'Mouse']
, 'price' : [1000, 500, None, 150, None] 
, 'stock' : [50, 150, 100, 200, 300]}

df3 = pd.DataFrame(data3)
df3

   product   price  stock
0   Laptop  1000.0     50
1   Tablet   500.0    150
2    Phone     NaN    100
3  Monitor   150.0    200
4    Mouse     NaN    300

In [62]:
df3.fillna(df3['price'].mean()).dropna()

   product   price  stock
0   Laptop  1000.0     50
1   Tablet   500.0    150
2    Phone   550.0    100
3  Monitor   150.0    200
4    Mouse   550.0    300

***Add a column state to df using mapping from city***

In [64]:
city_pop = { 'city' : ['New York', 'Los Angeles', 'Houston', 'Chicago']
, 'population' : [20000, 30000, 40000 , 60000] 
}

city_pop_df = pd.DataFrame(city_pop)
city_pop_df

          city  population
0     New York       20000
1  Los Angeles       30000
2      Houston       40000
3      Chicago       60000

In [70]:
city_to_state = {
    'New York' : 'New York'
    , 'Los Angeles' : 'California'
    , 'Houston' : 'Illinois'
    , 'Chicago' : 'Texas'
}

city_pop_df['state'] = city_pop_df['city'].map(city_to_state)

city_pop_df

          city  population       state
0     New York       20000    New York
1  Los Angeles       30000  California
2      Houston       40000    Illinois
3      Chicago       60000       Texas